#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.repository["tool-simulation"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-tool-simulation
            PACKAGE_NAME=tool-simulation
            PUBLISH_PACKAGE_NAME=tool-simulation-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=3000
            HOST_PORT_GRPC=
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "tool-simulation"
      + sha                 = (known after apply)
    }

  # module.repository["tool-simulation"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "86771d9f036481f6f5c93e09721e0c48ac518354" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-tool-simulation
            PACKAGE_NAME=tool-simulation
            PUBLISH_PACKAGE_NAME=tool-simulation-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=3000
            HOST_PORT_GRPC=
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "tool-simulation/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "tool-simulation" -> null
      - sha                 = "981dea4aaa0353363eae586d5ee72282105fd471" -> null
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-template-rust
            PACKAGE_NAME=lib-template-rust
            PUBLISH_PACKAGE_NAME=lib-template-rust
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "29aa1476ad1742891d2350d553fbf804ec0b4dbd" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-template-rust
            PACKAGE_NAME=lib-template-rust
            PUBLISH_PACKAGE_NAME=lib-template-rust
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "lib-template-rust/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "lib-template-rust" -> null
      - sha                 = "17c202772616a0f6939479d145998544beccab4c" -> null
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-router
            PACKAGE_NAME=lib-router
            PUBLISH_PACKAGE_NAME=lib-router
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "lib-router"
      + sha                 = (known after apply)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "332c6248cb6af0bf540cba9b2722deb8b0144077" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-lib/.env.base.tftpl
            
            DOCKER_NAME=arrow-lib-router
            PACKAGE_NAME=lib-router
            PUBLISH_PACKAGE_NAME=lib-router
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "lib-router/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "lib-router" -> null
      - sha                 = "125df3e5666fbafb1c82df43dafd74a52129e871" -> null
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-cargo
            PACKAGE_NAME=svc-cargo
            PUBLISH_PACKAGE_NAME=svc-cargo-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8000
            HOST_PORT_GRPC=50000
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-cargo"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "89a18274632c2f62b52d4ae31a93838921dae0ab" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-cargo
            PACKAGE_NAME=svc-cargo
            PUBLISH_PACKAGE_NAME=svc-cargo-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8000
            HOST_PORT_GRPC=50000
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "svc-cargo/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "svc-cargo" -> null
      - sha                 = "a7b019ecdd4dac321a54a81d058767bc9444ccdb" -> null
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-pricing
            PACKAGE_NAME=svc-pricing
            PUBLISH_PACKAGE_NAME=svc-pricing-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8001
            HOST_PORT_GRPC=50001
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-pricing"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "f73d95eb4b643b275fb6728f45f342a9b3da472b" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-pricing
            PACKAGE_NAME=svc-pricing
            PUBLISH_PACKAGE_NAME=svc-pricing-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8001
            HOST_PORT_GRPC=50001
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "svc-pricing/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "svc-pricing" -> null
      - sha                 = "f28dd755198712f882f7665d08c27cf740d88fb1" -> null
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-scheduler
            PACKAGE_NAME=svc-scheduler
            PUBLISH_PACKAGE_NAME=svc-scheduler-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8002
            HOST_PORT_GRPC=50002
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-scheduler"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "0081378990fa37f52782f130c99b52326d1aaa44" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-scheduler
            PACKAGE_NAME=svc-scheduler
            PUBLISH_PACKAGE_NAME=svc-scheduler-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8002
            HOST_PORT_GRPC=50002
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "svc-scheduler/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "svc-scheduler" -> null
      - sha                 = "046b6ecf207fe7339379665a6d084e827585d27a" -> null
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-storage
            PACKAGE_NAME=svc-storage
            PUBLISH_PACKAGE_NAME=svc-storage-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8003
            HOST_PORT_GRPC=50003
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-storage"
      + sha                 = (known after apply)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "c333602e29fa2861de06f2fc2559c53858d11c74" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-storage
            PACKAGE_NAME=svc-storage
            PUBLISH_PACKAGE_NAME=svc-storage-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8003
            HOST_PORT_GRPC=50003
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "svc-storage/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "svc-storage" -> null
      - sha                 = "09f086bf59863087c5fedfdd52ec7846017e9ef5" -> null
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = "chore(ci): .env.base - provisioned by terraform"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-template-rust
            PACKAGE_NAME=svc-template-rust
            PUBLISH_PACKAGE_NAME=svc-template-rust-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8080
            HOST_PORT_GRPC=50051
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "svc-template-rust"
      + sha                 = (known after apply)
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".env.base.tftpl"] will be destroyed
  # (because key [".env.base.tftpl"] is not in for_each map)
  - resource "github_repository_file" "files" {
      - branch              = "develop" -> null
      - commit_message      = "chore(ci): .env.base.tftpl - provisioned by terraform" -> null
      - commit_sha          = "4aa6f63b42e108cfa7c9ad15680dce7ebd3d8ed0" -> null
      - content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            DOCKER_NAME=arrow-svc-template-rust
            PACKAGE_NAME=svc-template-rust
            PUBLISH_PACKAGE_NAME=svc-template-rust-client-grpc
            DOCKER_PORT_REST=8000
            DOCKER_PORT_GRPC=50051
            HOST_PORT_REST=8080
            HOST_PORT_GRPC=50051
        EOT -> null
      - file                = ".env.base.tftpl" -> null
      - id                  = "svc-template-rust/.env.base.tftpl" -> null
      - overwrite_on_create = true -> null
      - repository          = "svc-template-rust" -> null
      - sha                 = "bd19be7cb56c36acc5b25dd54738be93d661061b" -> null
    }

Plan: 8 to add, 0 to change, 8 to destroy.

```

</details>

*Pusher: @owlot, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*